In [1]:
#import pandas as pd
import requests
from io import StringIO

In [2]:
#url = "https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day26-ordinal-encoding/customer.csv"
#headers = {"User-Agent":"Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
#req = requests.get(url, headers=headers)
#data = StringIO(req.text)

#df = pd.read_csv(data)
#df.head()

In [3]:
#df.to_csv('images/customer.csv')

In [4]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('images/customer.csv')
df.head()

   Unnamed: 0  age  gender   review education purchased
0           0   30  Female  Average    School        No
1           1   68  Female     Poor        UG        No
2           2   70  Female     Good        PG        No
3           3   72  Female     Good        PG        No
4           4   16  Female  Average        UG        No

In [6]:
df.shape

(50, 6)

In [7]:
df = df.iloc[:,1:]

In [8]:
df.head()

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

***Here age is numerical and gender is a nominal data so i skip this for now***

In [9]:
df=df.iloc[:,2:]

In [10]:
df.head()

    review education purchased
0  Average    School        No
1     Poor        UG        No
2     Good        PG        No
3     Good        PG        No
4  Average        UG        No

***Let's divide the data in train and test parts***

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
X_train,X_test,y_train,y_test=train_test_split(df.drop('purchased',axis=1), df['purchased'],
                                               test_size=0.2,random_state=True)
print("Shape of X_train is: ",X_train.shape)
print("Shape of X_test is: ",X_test.shape)
print("Shape of y_train is: ",y_test.shape)
print("Shape of y_test is: ",y_test.shape)

Shape of X_train is:  (40, 2)
Shape of X_test is:  (10, 2)
Shape of y_train is:  (10,)
Shape of y_test is:  (10,)

In [13]:
X_train.head()

     review education
32  Average        UG
39     Poor        PG
21  Average        PG
36     Good        UG
19     Poor        PG

# Ordinal Encoding

### ***Apply the ordinal encoding on review and education feature***

In [14]:
print(df['review'].value_counts())
print()
print(df['education'].value_counts())

Poor       18
Good       18
Average    14
Name: review, dtype: int64

PG        18
School    16
UG        16
Name: education, dtype: int64

In [15]:
from sklearn.preprocessing import OrdinalEncoder

In [16]:
oe = OrdinalEncoder(categories=[['Poor','Average','Good'],['School','UG','PG']]) #here we need to provide the
# order in wich category we want to convert these

In [17]:
oe.fit(X_train)

OrdinalEncoder(categories=[['Poor', 'Average', 'Good'], ['School', 'UG', 'PG']])

In [18]:
X_train_encoded = oe.transform(X_train)
X_test_encoded = oe.transform(X_test)

In [19]:
X_train_encoded = pd.DataFrame(X_train_encoded, columns=X_train.columns)
X_test_encoded = pd.DataFrame(X_test_encoded, columns=X_train.columns)

In [20]:
X_train_encoded.head()

   review  education
0     1.0        1.0
1     0.0        2.0
2     1.0        2.0
3     2.0        1.0
4     0.0        2.0

In [21]:
oe.categories_

[array(['Poor', 'Average', 'Good'], dtype=object),
 array(['School', 'UG', 'PG'], dtype=object)]

# Label Encoding

### ***Apply the Label Encoding on the target feature***

Remember that label Encoding is always use for output feature (target feature)

In [22]:
from sklearn.preprocessing import LabelEncoder

In [23]:
le = LabelEncoder()  # here we not decide or provide the order of categories it select it randomly by it self

In [24]:
le.fit(y_train)  # fit the encoder on target (y_train) feature

LabelEncoder()

In [25]:
le.classes_  # in label encoder there is classes instead of categories

array(['No', 'Yes'], dtype=object)

In [26]:
y_train_encoded = le.transform(y_train)
y_test_encoded = le.transform(y_test)

In [27]:
y_train_encoded = pd.DataFrame(y_train_encoded, columns=['purchased'])
y_test_encoded = pd.DataFrame(y_test_encoded, columns=['purchased'])

In [28]:
df_train = pd.merge(X_train_encoded, y_train_encoded, left_index=True, right_index=True)
df_test = pd.merge(X_test_encoded, y_test_encoded, left_index=True, right_index=True)
X_train.head()

     review education
32  Average        UG
39     Poor        PG
21  Average        PG
36     Good        UG
19     Poor        PG

In [29]:
df_test.shape

(10, 3)

In [30]:
df = pd.concat([df_train, df_test])
df.head()

   review  education  purchased
0     1.0        1.0          1
1     0.0        2.0          0
2     1.0        2.0          0
3     2.0        1.0          1
4     0.0        2.0          1

In [31]:
df.shape

(50, 3)

In [32]:
df = pd.read_csv('images/customer.csv')
df = df.drop(["review","education"], axis=1)
df = df.iloc[:,1:]
df.head()

   age  gender purchased
0   30  Female        No
1   68  Female        No
2   70  Female        No
3   72  Female        No
4   16  Female        No

In [33]:
X_train,X_test,y_train,y_test=train_test_split(df.drop('purchased',axis=1), df['purchased'],
                                               test_size=0.2,random_state=True)
print("Shape of X_train is: ",X_train.shape)
print("Shape of X_test is: ",X_test.shape)
print("Shape of y_train is: ",y_test.shape)
print("Shape of y_test is: ",y_test.shape)

Shape of X_train is:  (40, 2)
Shape of X_test is:  (10, 2)
Shape of y_train is:  (10,)
Shape of y_test is:  (10,)

what should we do when all cateogories have same values of repeated

# Apply the Nominal Onehot Encoding

In [34]:
#url = "https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day27-one-hot-encoding/cars.csv"
#headers = {"User-Agent":"Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
#req = requests.get(url, headers=headers)

#data = StringIO(req.text)
#df = pd.read_csv(data)
#df.to_csv('/home/saad/Downloads/cars.csv')

In [35]:
df = pd.read_csv('images/cars.csv')
df = df.iloc[:, 1:]

In [36]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [37]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [38]:
df['brand'].nunique()

32

In [39]:
df['owner'].value_counts()

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

In [40]:
df['fuel'].value_counts()

Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: fuel, dtype: int64

## 1.Onehotencoding using Pandas

In [41]:
# as there is less categories in fuel and owner feature so i apply the encoding first upon these features
pd.get_dummies(df,columns=['fuel','owner']) #see there are 12 columns

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

## 2.  k-1 one_hot_encoding

In [42]:
# when we apply the onehot encoding so there is a chance of inventing multi collnearity between features of
# independent due to those collenearity those features are dependent on each other and the independece of 
# X features will be distorted # so for removing this problem we need to remove the collenearity 
# and for that we use drop_first function in it which drop the first category column of every feature

In [43]:
df = pd.get_dummies(df, columns=['fuel','owner'], drop_first=True) # after applying this function
# since there are 2 category features so the first feature of every feature after applying encoding
# will removed

In [44]:
df #and the current shape will be 10 columns

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

NOTE: We can't use the pandas for one hot encoding because when we give this data (who's encoded by pandas) to machine learning algorithm so there is less chance that it remains same as before, so for avoiding this problem we use the sklearn class,  one_hot_encoder

## 3.One_hot_Encoding using sklearn

In [45]:
df = pd.read_csv('images/cars.csv')
df = df.iloc[:, 1:]
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [46]:
X = df.drop('selling_price', axis=1)
y = df['selling_price']

In [47]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y, test_size=0.3, random_state=True)

In [48]:
from sklearn.preprocessing import OneHotEncoder

In [49]:
ohe = OneHotEncoder(drop='first', dtype='int64') # if we use sparse=False then we not need to use toarray()
# we can also provide the dtype for reducing memory size

In [50]:
X_train_new = ohe.fit_transform(X_train[['fuel','owner']]).toarray() #toarray is use to converting in the array form
X_test_new = ohe.transform(X_test[['fuel','owner']]).toarray()
X_train_new

array([[0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [0, 0, 1, ..., 0, 0, 0]])

In [51]:
X_train[['brand','km_driven']].values

array([['Chevrolet', 50000],
       ['Chevrolet', 120000],
       ['Hyundai', 60000],
       ...,
       ['Hyundai', 70000],
       ['Maruti', 110000],
       ['Maruti', 65755]], dtype=object)

In [52]:
X_train.shape

(5689, 4)

In [53]:
# now i merge the data horizontally(horizontally stack)
np.hstack((X_train[['brand','km_driven']].values, X_train_new))

array([['Chevrolet', 50000, 0, ..., 0, 0, 0],
       ['Chevrolet', 120000, 1, ..., 1, 0, 0],
       ['Hyundai', 60000, 0, ..., 0, 0, 0],
       ...,
       ['Hyundai', 70000, 0, ..., 0, 0, 0],
       ['Maruti', 110000, 1, ..., 1, 0, 0],
       ['Maruti', 65755, 0, ..., 0, 0, 0]], dtype=object)

In [54]:
np.hstack((X_train[['brand','km_driven']].values, X_train_new)).shape

(5689, 9)

## 4.One_hot_encoding with top categories

In [55]:
counts = df['brand'].value_counts()

In [56]:
#df['brand'].unique()
threshhold = 100

In [57]:
repl1 = counts[counts<=threshhold].index

In [58]:
pd.get_dummies(df['brand'].replace(repl1, 'uncommon'), drop_first=True)

,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
0,0,0,0,0,0,1,0,0,0,0,0,0
1,0,0,0,0,0,0,0,1,0,0,0,0
2,0,0,1,0,0,0,0,0,0,0,0,0
3,0,0,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,0,0,0,1,0,0,0,0,0,0,0,0
8124,0,0,0,1,0,0,0,0,0,0,0,0
8125,0,0,0,0,0,1,0,0,0,0,0,0
8126,0,0,0,0,0,0,0,0,1,0,0,0
8127,0,0,0,0,0,0,0,0,1,0,0,0